---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoubleType
source: html/44348510-6e8e-fb84-4e0c-8ce948110419.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldDoubleType Property

"Double Type"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldDoubleType { get; }
```